Repository: wescamp/A_Simple_Campaign-1.10
Catalog: po/*.po
Languages: fr, uk

source: A Simple Campaign
fr: Une Campagne Simple
uk: Проста Кампанія

source: ASC
fr: UCS
uk: ПК

source: &units/undead-necromancers/adept-magic-3.png=Easy;*&units/undead-necromancers/dark-sorcerer-attack-staff-2.png=Medium;&units/undead-necromancers/ancient-lich-magic-3.png=Difficult
fr: &units/undead-necromancers/adept-magic-3.png=Facile;*&units/undead-necromancers/dark-sorcerer-attack-staff-2.png=Moyen;&units/undead-necromancers/ancient-lich-magic-3.png=Difficile
uk: &units/undead-necromancers/adept-magic-3.png=Простий;*&units/undead-necromancers/dark-sorcerer-attack-staff-2.png=Середній;&units/undead-necromancers/ancient-lich-magic-3.png=Складний

source: This is a stub of a campaign, intended to make life easier in creating a campaign. Contains about the bare minimum that's needed for a campaign and some helpful comments.
fr: Ceci est une ébauche de campagne, destinée à rendre la création d’une campagne plus facile. Contient le strict minimum nécessaire à une campagne et quelques commentaires utiles.
uk: Це незавершена кампанія, покликана упростити створення кампаній. Містить близько мінімуму, що потрібно для кампанії і деякі корисні коментарі.

source: this is where the story goes
fr: C’est là que l'histoire commence
uk: ось тут починається історія

source: Template
fr: Modèle
uk: Шаблон

source: His Awesomeness
fr: Le Stupéfiant
uk: Його Жахливість

source: Lord Awesomeness
fr: Seigneur Stupéfiant
uk: Лорд Жахливість

source: Welcome, future UMC developer. This is a stub of a campaign, intended to make life easier in creating a campaign, since the by far most difficult part is the very start. This campaign contains about the bare minimum that's needed for a campaign and some helpful comments. Note that by creating a campaign which targets wesnoth's development version you may run into engine bugs which you mistakenly think of being caused by your wml code.
fr: Bonjour, futur développeur d'UMC. Ceci est une ébauche de campagne, destinée à rendre la création d’une campagne plus facile, car la partie de loin la plus difficile est le début. Cette campagne contient le strict minimum nécessaire à une campagne et quelques commentaires utiles. Notez que en créant une campagne destinée à la version de développement de Wesnoth, vous pouvez rencontrer des bugs du moteur que vous penserez à tort être causés par votre code WML.

source: There is a site in the wesnoth wiki related to this add-on, which also tells you where to look for this add-on's files so you can actually read this message in the code instead of reading it on the screen: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
fr: Il y a une page liée à cette extension dans le wiki de Wesnoth, elle vous indique également où chercher les fichiers de cette extension afin que vous puissiez réellement lire ce message dans le code au lieu de le lire à l'écran : http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
uk: В Вікі wesnoth існує сайт, пов'язаний з цим аддоном, який також повідомить вам, де шукати файли аддону, так що ви зможете прочитати це повідомлення в коді, а не читати його на екрані: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign

source: site related to this add-on: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
fr: Page en rapport avec cette extension : http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign
uk: сайт, пов'язаний з цим аддоном: http://wiki.wesnoth.org/BuildingCampaignsTutorial/FirstCampaign

source: The files of this add-on, describing what happens in it, are in your userdata directory, explanation where this directory is here: http://wiki.wesnoth.org/EditingWesnoth
fr: Les dossiers de cette extension contenant la description de ce qui s'y passe, se trouvent dans votre répertoire userdata, l'explication pour savoir où trouver ce répertoire est ici : http://wiki.wesnoth.org/EditingWesnoth
uk: Файли цього аддону, що описують те, що відбувається в ньому, знаходяться в вашій теці користувача, а пояснення, де ця тека, читайте тут: http://wiki.wesnoth.org/EditingWesnoth

source: Where are the files of this add-on ? read here: http://wiki.wesnoth.org/EditingWesnoth
fr: Où sont les fichiers de cette extension ? Lire ici : http://wiki.wesnoth.org/EditingWesnoth
uk: Де знаходяться файли цього аддону ? читайте тут: http://wiki.wesnoth.org/EditingWesnoth

source: final objectives:
fr: objectifs finaux :
uk: фінальні цілі:

source: Defeat the enemy leader
fr: Vaincre le chef ennemi
uk: Подолайте ворожого лідера

source: Death of His Awesomenes
fr: Mort de Le Stupéfiant
uk: Смерть Його Жахливості

source: Hey, I'm a custom unit of this campaign and I've just appeared.
fr: Hé, je suis une unité personnalisée de cette campagne et je viens d’apparaître.
uk: Ей, я користувацький боєць цієї кампанії, і я щойно з'явився.

source: I'm a unit on side 1 and have just moved to the hex with coordinates $x1,$y1.
fr: Je suis une unité du camp 1 et je viens de me déplacer vers l'hexagone avec les coordonnées $x1;$y1.
uk: Я боєць на стороні 1 і я щойно перемістився на поле з координатами $x1,$y1.

source: Let's play some custom sound...
fr: Jouons des sons personnalisés...
uk: Давайте відтворимо якийсь звук...

source: This is the macro from macros/. Soon follows another macro. The code from this event is a bit more adanced wml.
fr: Il s'agit d'une macro du répertoire macros/. Bientôt suivie d'une autre macro. Le code de cet événement est un code wml un peu plus avancé.

source: two times three is $twotimesthree|.
fr: Deux fois trois a pour résultat $twotimesthree|.
uk: двічі три буде $twotimesthree|.

source: Since the variable twotimesthree is cleared now, you can no longer query it: $twotimesthree| You should always clear your variables once that you no longer need them.
fr: La variable twotimesthree est effacée maintenant, vous ne pouvez plus l'utiliser : $twotimesthree| Vous devez toujours nettoyer vos variables une fois que vous n'en avez plus besoin.
uk: Оскільки змінна twotimesthree зараз очищена, ви більше не можете її використати: $twotimesthree| Ви завжди повинні очищати змінні тоді, коли вам вони більше не потрібні.

source: ASC's custom terrain
fr: Un terrain personnalisé de UCS
uk: якась місцевість ПК

source: some custom unit
fr: Une unité personnalisée
uk: якийсь боєць

source: This is a custom unit in ASC demonstrating how to create such units.
fr: Ceci est une unité personnalisée d’UCS, décrivant comment créer de telles unités.
uk: Це користувацький боєць в ПК, що демонструє як створювати таких бійців.

source: Sword
fr: Épée
uk: Меч

source: This is the macro from utils/. Let's calculate a bit and return the result. This macro is a bit more advanced, you don't need to care about it at the beginning.
fr: Il s'agit d'une macro du répertoire utils/. Nous allons effectuer un petit calcul et retourner le résultat. Cette macro est un peu plus avancée, il n'est pas nécessaire de s'en soucier au début.
uk: Це макрос з utils/. Давайте трохи порахуємо і повернемо результат. Цей макрос є більш складним, вам не потрібно піклуватися про це на самому початку.

source: Variable with name two has been set to $two|.
fr: La variable nommée two est initialisée à $two|.
uk: Змінна з іменем two була встановлена на $two|.

source: Variable with name two has been multiplied by 3 to value $two|.
fr: La variable nommée two a été multipliée par 3 prenant ainsi comme valeur $two|.
uk: Змінна з іменем two була помножена на 3 і встановлена на $two|.
